tests/performance/scenarios/todos-get.yml
config:
  target: "{{ $env.BASE_URL }}"
  processor: "../processor.ts"
  phases:
    - duration: 120
      arrivalRate: 10
      maxVusers: 50
  ensure:
    thresholds:
      - http.response_time.p95: 1000
      - http.error_rate: 1

scenarios:
  - name: todos-get
    beforeScenario: generateJwt
    flow:
      - get:
          url: "/app/example/v0/todos/todo-1"
          headers:
            Authorization: "Bearer {{ jwt }}"
          expect:
            - statusCode: 200